In [1]:
#Imports
import os
os.environ["OMP_NUM_THREADS"] = '1'
import pandas as pd
import numpy as np
from sqlalchemy.types import *
from sqlalchemy.engine import create_engine
import pymysql
from urllib.parse import quote_plus
from sqlalchemy_utils import create_database, database_exists

# My SQL

In [2]:
pymysql.install_as_MySQLdb()
import json
with open('C:/Users/Mikey.Windows/Documents/keys/keys.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection =f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"
engine = create_engine(connection)

In [4]:
if not database_exists(connection):
    create_database(connection)

# Data imports

In [5]:
csv=[
    'C:/Users/Mikey.Windows/Documents/GitHub/Project-3/Data/tmdb_results_combined.csv.gz',
    'C:/Users/Mikey.Windows/Documents/GitHub/Project-3/Data/basics_filtered.csv.gz',
    'C:/Users/Mikey.Windows/Documents/GitHub/Project-3/Data/ratings_filtered.csv.gz']

In [6]:
tmdb=pd.read_csv(csv[0])
basics=pd.read_csv(csv[1])
ratings=pd.read_csv(csv[2])

In [7]:
tmdb.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

In [8]:
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118.0,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70.0,Drama

In [9]:
ratings.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265

# Basics

## Cleaning Basics before normalizing genres.

In [10]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118.0,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70.0,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122.0,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100.0,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126.0,Drama

In [11]:
basics=basics.drop(columns=['originalTitle','isAdult','titleType'])

In [12]:
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,NaN,118.0,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70.0,Drama
2,tt0069049,The Other Side of the Wind,2018,NaN,122.0,Drama
3,tt0088751,The Naked Monster,2005,NaN,100.0,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,NaN,126.0,Drama

## Split out genres for normalizing.

In [13]:
basics['genres_split']=basics['genres'].str.split(',')
explode_g=basics.explode('genres_split')
explode_g

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118.0,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,NaN,118.0,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,NaN,118.0,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70.0,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018,NaN,122.0,Drama,Drama
...,...,...,...,...,...,...,...
81889,tt9916190,Safeguard,2020,NaN,95.0,"Action,Adventure,Thriller",Action
81889,tt9916190,Safeguard,2020,NaN,95.0,"Action,Adventure,Thriller",Adventure
81889,tt9916190,Safeguard,2020,NaN,95.0,"Action,Adventure,Thriller",Thriller
81890,tt9916362,Coven,2020,NaN,92.0,"Drama,History",Drama
81890,tt9916362,Coven,2020,NaN,92.0,"Drama,History",History

In [14]:
unique_g=sorted(explode_g['genres_split'].unique())
unique_g

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [15]:
title_g=explode_g[['tconst','genres_split']].copy()
title_g.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [16]:
genre_ints=range(len(unique_g))
genre_map=dict(zip(unique_g,genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [17]:
basics['genre_id']=basics['genres_split'].replace(genre_map)
basics['genre_id'] = basics['genre_id'].str[0].fillna(basics['genre_id'])
basics=basics.drop(columns='genres_split')

In [18]:
genre_lookup=pd.DataFrame({'Genre_Name':genre_map.keys(),
                          'Genre_ID':genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [19]:
genre_lookup.value_counts()

Genre_Name  Genre_ID
Action      0           1
Music       13          1
War         23          1
Thriller    22          1
Talk-Show   21          1
Sport       20          1
Sci-Fi      19          1
Romance     18          1
Reality-TV  17          1
News        16          1
Mystery     15          1
Musical     14          1
Horror      12          1
Adult       1           1
History     11          1
Game-Show   10          1
Fantasy     9           1
Family      8           1
Drama       7           1
Crime       6           1
Comedy      5           1
Biography   4           1
Animation   3           1
Adventure   2           1
Western     24          1
dtype: int64

#  title_basics table

In [20]:
basics=basics.drop(columns='genres')

In [21]:
key_len=max_str_len=basics['tconst'].fillna('').map(len).max()
title_len=basics['primaryTitle'].fillna('').map(len).max()
df_schema={'tconst':String(key_len+1),
          'primaryTitle':Text(title_len+1),
          'startYear':Float(),
          'endYear':Float(),
          'runtimeMinutes':Integer()}

In [22]:
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',
              index=False)

81891

In [23]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [24]:
result=engine.execute('SELECT * FROM title_basics LIMIT 5')
for row in result:
    print(row)

('tt0035423', 'Kate & Leopold', 2001.0, None, 118, 'Comedy')
('tt0062336', 'The Tango of the Widower and Its Distorting Mirror', 2020.0, None, 70, 'Drama')
('tt0069049', 'The Other Side of the Wind', 2018.0, None, 122, 'Drama')
('tt0088751', 'The Naked Monster', 2005.0, None, 100, 'Comedy')
('tt0096056', 'Crime and Punishment', 2002.0, None, 126, 'Drama')

# title_genre table

In [25]:
title_g=title_g.drop_duplicates('tconst')

In [26]:
df_schema={'tconst':String(key_len+1),
           'Genre_ID':Integer()}

In [27]:
title_g.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',
              index=False)

81891

In [28]:
result=engine.execute('SELECT * FROM title_genres LIMIT 5')
for row in result:
    print(row)

('tt0035423', 'Comedy')
('tt0062336', 'Drama')
('tt0069049', 'Drama')
('tt0088751', 'Comedy')
('tt0096056', 'Drama')

# genres table

In [29]:
df_schema={'Genre_Name':String(length=10),
           'Genre_ID':Integer()}

In [30]:
genre_lookup.to_sql('genres',engine,dtype=df_schema,if_exists='replace',
              index=False)

25

In [31]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [32]:
result=engine.execute('SELECT * FROM genres LIMIT 5')
for row in result:
    print(row)

('Action', 0)
('Adult', 1)
('Adventure', 2)
('Animation', 3)
('Biography', 4)

# title_ratings table

In [33]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265
2  tt0000005            6.2      2631
3  tt0000006            5.1       182
4  tt0000007            5.4       824

In [34]:
df_schema={'tconst':String(key_len+1),
           'numVotes':Integer(),
           'averageRating':Integer()}

In [35]:
ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',
              index=False)

503723

In [36]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [37]:
result=engine.execute('SELECT * FROM title_ratings LIMIT 5')
for row in result:
    print(row)

('tt0000001', 6, 1987)
('tt0000002', 6, 265)
('tt0000005', 6, 2631)
('tt0000006', 5, 182)
('tt0000007', 5, 824)

# tmdb_data table

In [38]:
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,2255.0,PG

In [39]:
tmdb['certification'].unique()

array([nan, 'PG', 'R', 'G', 'NR', 'PG-13', 'NC-17', 'Unrated'],
      dtype=object)

In [40]:
tmdb_keepers=tmdb[['imdb_id','revenue','budget','certification']].copy()

In [41]:
tmdb_keepers=tmdb_keepers.drop_duplicates('imdb_id')

In [42]:
df_schema={'imdb_id':String(key_len+1),
           'revenue':Integer(),
           'budget':Integer(),
           'certification':String(length=10)}

In [43]:
tmdb_keepers.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',
              index=False)

2591

In [44]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [45]:
result=engine.execute('SELECT * FROM tmdb_data LIMIT 5')
for row in result:
    print(row)

('0', None, None, None)
('tt0035423', 76019048, 48000000, 'PG-13')
('tt0113026', 0, 10000000, None)
('tt0113092', 0, 0, None)
('tt0114447', 0, 0, None)

# SHOW TABLES QUERY

In [46]:
result=engine.execute('SHOW TABLES')
for row in result:
    print(row)

('genres',)
('title_basics',)
('title_genres',)
('title_ratings',)
('tmdb_data',)